Revit 2027 API
AnalysisDisplayStyle.IsNameUnique Method
 Verify the uniqueness of the name among all analysis display style elements of the document.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsNameUnique(
	Document document,
	string name,
	AnalysisDisplayStyle excludedElement
)
Public Shared Function IsNameUnique (
	document As Document,
	name As String,
	excludedElement As AnalysisDisplayStyle
) As Boolean
public:
static bool IsNameUnique(
	Document^ document,
	String^ name,
	AnalysisDisplayStyle^ excludedElement
)
static member IsNameUnique :
        document : Document *
        name : string *
        excludedElement : AnalysisDisplayStyle -> bool
Parameters
document Document
 Document in which name uniqueness is verified.
name String
 Name to verify uniqueness of.
excludedElement AnalysisDisplayStyle
 Element to be excluded from uniqueness verification (for renaming of an existing element).
Return Value
Boolean
 True if name is unique, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace